# Key Data structure in python
- `series`
- `dataframe`

In [ ]:
# %pip install pandas
import pandas as pd

In [19]:
series=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(series)
type(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

pandas.core.series.Series

## Encoding Technique used in craeting datasets
- `.latin1`
- `utf-8`


- There are three different methods to read different types of files in Python:

    1. `pd.read_csv()` – for CSV files  
        - pd.read_csv(source,encoding=utf-8) function is used to read a comma-separated values (CSV) file into a DataFrame.
    2. `pd.read_excel()` – for Excel files  
    3. `pd.read_json()` – for JSON files

In [ ]:
df2 = pd.read_csv("employee_data.csv")
df

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
0,1,DanielTaylor,25.0,UK,HR,Analyst,NaN,04-06-2023
1,2,EthanBrown,44.0,India,Marketing,Executive,98549.20,13-01-2018
2,3,SophiaMartinez,inf,Japan,Finance,Developer,85565.84,30-04-2015
3,4,EthanMartinez,47.0,Germany,Support,Analyst,34513.67,17-06-2015
4,5,MiaBrown,32.0,Australia,Support,Consultant,45339.72,22-02-2019
...,...,...,...,...,...,...,...,...
29995,29996,MiaBrown,42.0,Australia,Support,Manager,133474.82,03-07-2015
29996,29997,MasonThomas,41.0,Mexico,Engineering,Assistant,140793.59,12-10-2023
29997,29998,LilyAnderson,44.0,India,Marketing,Developer,68464.72,28-06-2021
29998,29999,MasonTaylor,46.0,Brazil,Finance,Assistant,148323.28,11-11-2017
29999,30000,LucasJackson,NaN,Mexico,Finance,Developer,93451.72,17-03-2017

In [21]:
df.head()#by default 5 rows ,returns matrix of head(number)

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
0,1,DanielTaylor,25.0,UK,HR,Analyst,NaN,04-06-2023
1,2,EthanBrown,44.0,India,Marketing,Executive,98549.20,13-01-2018
2,3,SophiaMartinez,inf,Japan,Finance,Developer,85565.84,30-04-2015
3,4,EthanMartinez,47.0,Germany,Support,Analyst,34513.67,17-06-2015
4,5,MiaBrown,32.0,Australia,Support,Consultant,45339.72,22-02-2019

In [22]:
df.tail()#by default 5 rows ,returns matrix of tail(number)

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
29995,29996,MiaBrown,42.0,Australia,Support,Manager,133474.82,03-07-2015
29996,29997,MasonThomas,41.0,Mexico,Engineering,Assistant,140793.59,12-10-2023
29997,29998,LilyAnderson,44.0,India,Marketing,Developer,68464.72,28-06-2021
29998,29999,MasonTaylor,46.0,Brazil,Finance,Assistant,148323.28,11-11-2017
29999,30000,LucasJackson,NaN,Mexico,Finance,Developer,93451.72,17-03-2017

In [23]:
df.describe()
#error occured due to missing values in the dataset

d:\website\rex\programs\PYTHON\12_numpy_pandas\.venv\Lib\site-packages\pandas\core\nanops.py:1016: RuntimeWarning: invalid value encountered in subtract
  sqr = _ensure_numeric((avg - values) ** 2)
d:\website\rex\programs\PYTHON\12_numpy_pandas\.venv\Lib\site-packages\pandas\core\nanops.py:1016: RuntimeWarning: invalid value encountered in subtract
  sqr = _ensure_numeric((avg - values) ** 2)

        Employee_ID      Age     Salary
count  30000.000000  29995.0   29997.00
mean   15000.500000      inf        inf
std     8660.398374      NaN        NaN
min        1.000000     22.0   30004.78
25%     7500.750000     31.0   59546.22
50%    15000.500000     41.0   89545.49
75%    22500.250000     51.0  119844.22
max    30000.000000      inf        inf

## Data selection

In [24]:
df[["Employee_ID","Employee_Name","Salary"]]

       Employee_ID   Employee_Name     Salary
0                1    DanielTaylor        NaN
1                2      EthanBrown   98549.20
2                3  SophiaMartinez   85565.84
3                4   EthanMartinez   34513.67
4                5        MiaBrown   45339.72
...            ...             ...        ...
29995        29996        MiaBrown  133474.82
29996        29997     MasonThomas  140793.59
29997        29998    LilyAnderson   68464.72
29998        29999     MasonTaylor  148323.28
29999        30000    LucasJackson   93451.72

[30000 rows x 3 columns]

## Missing value in each columns :-

In [25]:
print(pd.isnull(df).sum())

Employee_ID      0
Employee_Name    0
Age              5
Country          1
Department       0
Position         0
Salary           3
Joining_Date     1
dtype: int64

## Removing missing values:-

In [26]:
df.dropna()

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
1,2,EthanBrown,44.0,India,Marketing,Executive,98549.20,13-01-2018
2,3,SophiaMartinez,inf,Japan,Finance,Developer,85565.84,30-04-2015
3,4,EthanMartinez,47.0,Germany,Support,Analyst,34513.67,17-06-2015
4,5,MiaBrown,32.0,Australia,Support,Consultant,45339.72,22-02-2019
6,7,MasonBrown,48.0,UK,Finance,Assistant,58227.95,24-08-2021
...,...,...,...,...,...,...,...,...
29994,29995,AvaBrown,54.0,Germany,Sales,Assistant,146287.00,28-11-2016
29995,29996,MiaBrown,42.0,Australia,Support,Manager,133474.82,03-07-2015
29996,29997,MasonThomas,41.0,Mexico,Engineering,Assistant,140793.59,12-10-2023
29997,29998,LilyAnderson,44.0,India,Marketing,Developer,68464.72,28-06-2021
29998,29999,MasonTaylor,46.0,Brazil,Finance,Assistant,148323.28,11-11-2017

## Filling missing values with a constant
- syntax 
   - ` df.fillna(value)`
   - ` df.fillna(value, inplace=True)`- inplace inside any pandas fn can change the value in the original dataframe

In [27]:
df.fillna(0)

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
0,1,DanielTaylor,25.0,UK,HR,Analyst,0.00,04-06-2023
1,2,EthanBrown,44.0,India,Marketing,Executive,98549.20,13-01-2018
2,3,SophiaMartinez,inf,Japan,Finance,Developer,85565.84,30-04-2015
3,4,EthanMartinez,47.0,Germany,Support,Analyst,34513.67,17-06-2015
4,5,MiaBrown,32.0,Australia,Support,Consultant,45339.72,22-02-2019
...,...,...,...,...,...,...,...,...
29995,29996,MiaBrown,42.0,Australia,Support,Manager,133474.82,03-07-2015
29996,29997,MasonThomas,41.0,Mexico,Engineering,Assistant,140793.59,12-10-2023
29997,29998,LilyAnderson,44.0,India,Marketing,Developer,68464.72,28-06-2021
29998,29999,MasonTaylor,46.0,Brazil,Finance,Assistant,148323.28,11-11-2017
29999,30000,LucasJackson,0.0,Mexico,Finance,Developer,93451.72,17-03-2017

## Renamimg columns:-
- Syntax: `df.rename(columns={'old_name': 'new_name'})` 
- return a new data frame

In [28]:
df.rename(columns={'Employee_ID': 'Emp_id', 'Employee_Name': 'Emp_name'})

,Emp_id,Emp_name,Age,Country,Department,Position,Salary,Joining_Date
0,1,DanielTaylor,25.0,UK,HR,Analyst,NaN,04-06-2023
1,2,EthanBrown,44.0,India,Marketing,Executive,98549.20,13-01-2018
2,3,SophiaMartinez,inf,Japan,Finance,Developer,85565.84,30-04-2015
3,4,EthanMartinez,47.0,Germany,Support,Analyst,34513.67,17-06-2015
4,5,MiaBrown,32.0,Australia,Support,Consultant,45339.72,22-02-2019
...,...,...,...,...,...,...,...,...
29995,29996,MiaBrown,42.0,Australia,Support,Manager,133474.82,03-07-2015
29996,29997,MasonThomas,41.0,Mexico,Engineering,Assistant,140793.59,12-10-2023
29997,29998,LilyAnderson,44.0,India,Marketing,Developer,68464.72,28-06-2021
29998,29999,MasonTaylor,46.0,Brazil,Finance,Assistant,148323.28,11-11-2017
29999,30000,LucasJackson,NaN,Mexico,Finance,Developer,93451.72,17-03-2017

##  Changing Dtype:-

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee_ID    30000 non-null  int64
 1   Employee_Name  30000 non-null  object
 2   Age            29995 non-null  float64
 3   Country        29999 non-null  object
 4   Department     30000 non-null  object
 5   Position       30000 non-null  object
 6   Salary         29997 non-null  float64
 7   Joining_Date   29999 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 1.8+ MB

In [30]:
df["Employee_ID"]=df["Employee_ID"].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Employee_ID    30000 non-null  float64
 1   Employee_Name  30000 non-null  object
 2   Age            29995 non-null  float64
 3   Country        29999 non-null  object
 4   Department     30000 non-null  object
 5   Position       30000 non-null  object
 6   Salary         29997 non-null  float64
 7   Joining_Date   29999 non-null  object
dtypes: float64(3), object(5)
memory usage: 1.8+ MB

# Adding and removing columns

In [31]:
df["new_column"]=[5000 for i in range(len(df))]
df

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date,new_column
0,1.0,DanielTaylor,25.0,UK,HR,Analyst,NaN,04-06-2023,5000
1,2.0,EthanBrown,44.0,India,Marketing,Executive,98549.20,13-01-2018,5000
2,3.0,SophiaMartinez,inf,Japan,Finance,Developer,85565.84,30-04-2015,5000
3,4.0,EthanMartinez,47.0,Germany,Support,Analyst,34513.67,17-06-2015,5000
4,5.0,MiaBrown,32.0,Australia,Support,Consultant,45339.72,22-02-2019,5000
...,...,...,...,...,...,...,...,...,...
29995,29996.0,MiaBrown,42.0,Australia,Support,Manager,133474.82,03-07-2015,5000
29996,29997.0,MasonThomas,41.0,Mexico,Engineering,Assistant,140793.59,12-10-2023,5000
29997,29998.0,LilyAnderson,44.0,India,Marketing,Developer,68464.72,28-06-2021,5000
29998,29999.0,MasonTaylor,46.0,Brazil,Finance,Assistant,148323.28,11-11-2017,5000
29999,30000.0,LucasJackson,NaN,Mexico,Finance,Developer,93451.72,17-03-2017,5000

### New col using fn

In [32]:
def fx(x):
    return x//5000
df['div-Salary']=df['Salary'].apply(fx)
df[['Salary','new_column','div-Salary']]

          Salary  new_column  div-Salary
0            NaN        5000         NaN
1       98549.20        5000        19.0
2       85565.84        5000        17.0
3       34513.67        5000         6.0
4       45339.72        5000         9.0
...          ...         ...         ...
29995  133474.82        5000        26.0
29996  140793.59        5000        28.0
29997   68464.72        5000        13.0
29998  148323.28        5000        29.0
29999   93451.72        5000        18.0

[30000 rows x 3 columns]

## Saving the DataFrame to a  file
- `df.to_csv(`'data.csv', index=False`)`
    - `index=True`- saves the DataFrame with the index column
    - `index=False`- By default,saves the DataFrame without the index column

- `df.to_json('data.json', index=False)`

- `df.to_excel('data.xlsx', index=False)`

In [33]:
new_df=df.fillna(0).head()
new_df.to_csv('newdf.csv',index=False)

### Concat two DataFrames

In [37]:
df1=pd.DataFrame({
    'Name':["Akash",'Priysnka','Rahul'],
'Marks':[4,5,6]})

df2=pd.DataFrame({
    'Name':["Akash",'Priysnka','Rahul'],
'Roll No':[4234,2345,654]})

pd.concat([df1,df2])

       Name  Marks  Roll No
0     Akash    4.0      NaN
1  Priysnka    5.0      NaN
2     Rahul    6.0      NaN
0     Akash    NaN   4234.0
1  Priysnka    NaN   2345.0
2     Rahul    NaN    654.0

### Merging two df
- `on='Col-Name'` 
    - merging two df on Col-Name column 
    - return only duplicate rows

In [39]:
pd.merge(df1,df2,on='Name')

       Name  Marks  Roll No
0     Akash      4     4234
1  Priysnka      5     2345
2     Rahul      6      654